const { Post } = require('../models');

const postData = [
    {
        title: "Nisi anim nulla dolore sunt fugiat aliqua amet non eu pariatur.",
        article_content: "Taskinator is a task-tracker app that will allow you to organize your personal to-do list items by clicking and dragging them into categories like To Do, In Progress, and Completed.",
        user_id: 3
    },
    {
        title: "Zoo Keepr reaches 1 million subscribers!",
        article_content: "‘વચનામૃત’નો મુખ્ય પ્રતિપાદિત વિષય અધ્યાત્મજ્ઞાન છે. તેમાં ધર્મ, જ્ઞાન, વૈરાગ્ય અને ભક્તિ – એટલે કે એકાંતિક ધર્મનું સુપેરે નિરૂપણ છે. તેની સાથે કર્તા, સાકાર, સર્વોપરી ને પ્રગટ ભગવત્સ્વરૂપના માહાત્મ્યજ્ઞાન સાથે નિશ્ચયની મહત્તા, અક્ષરધામના પરમ સુખની છતી દેહે પ્રાપ્તિ, તેમાં આવતાં વિઘ્નોની ઓળખ, જીવોના આત્યંતિક કલ્યાણ માટે ભગવાન અથવા ભગવાનના અખંડ ધારક પરમ એકાંતિક સંતની આવશ્યકતા, અક્ષરધામ સિવાય અન્ય સર્વે લોક, તેના વૈભવ વગેરેનું નાશવંતપણું, પંચવિષયની તુચ્છતા, દોષરહિત થવા ને માયાપર થવા અક્ષરબ્રહ્મસ્વરૂપ સંતની અનિવાર્યતા વગેરે અગણિત વિષયો પર પરબ્રહ્મ પુરુષોત્તમ નારાયણનું શ્રીમુખનું અમૃત વરસ્યું છે.",
        user_id: 1
    },
    {
        title: "સંવત ૧૮૭૭ના કાર્તિક વદિ ૧૧ એકાદશીને દિવસ સ્વામી ",
        article_content: "ભગવાન સ્વામિનારાયણે વેદો, ઉપનિષદો, રામાયણ-મહાભારત જેવા ઇતિહાસ ગ્રંથો, શ્રીમદ્‌ભાગવત આદિ અઢાર પુરાણો વગેરેનું દોહન કરીને આ વચનામૃતોમાં સારભૂત તત્ત્વ પીરસ્યુ છે.",
        user_id: 2

    },
    {
        title: "વિશ્વાસી, જ્ઞાની, શૂરવીર અને પ્રીતિવાળાનું",
        article_content: "વીર હોય તે થકી તો ઇન્દ્રિયો તથા અંતઃકરણ એ સર્વે થરથર કંપતાં રહે અને બીજા કોઈથી પણ ડરે નહીં, માટે એને કોઈ રીતે પરમેશ્વરની આજ્ઞામાં ભંગ થાય નહીં. માટે પોતાને કૃતાર્થપણું માને અને મૃત્યુનો ત્રાસ તેના મનમાં લેશમાત્ર પણ હોય નહીં. અને ચોથો જે પ્રીતિવાળો તેને તો પતિવ્રતાનું અંગ છે. જેમ પતિવ્રતા સ્ત્રી હોય તેને પોતાના પતિ વિના બીજે ઠેકાણે વૃત્તિ ડોલે નહીં ને એક પોતાના પતિને વિષે જ પ્રીતિ રાખે, તેમ તે ભગવાનનો ભક્ત તે પતિવ્રતાની પેઠે ",
        user_id: 5
    },
    {
        title: "ભગવાન મળ્યા છે માટે હું કૃતાર્થ ",
        article_content: "બીજાં ચાર ભૂત તેનો મોટો વિસ્તાર છે અને તેનાં કારણ જે શબ્દાદિક તે સૂક્ષ્મ છે. અને જે કારણ હોય તે નાનું હોય તો પણ તે મોટા કાર્યને ઉત્પન્ન કરવાને સમર્થ થાય એવી એમાં કળા રહી છે. જેમ અગ્નિદેવ છે તે તો મનુષ્ય જેવા મૂર્તિમાન છે અને માણસ જેવડો છે, અને તેનું કાર્ય જે અગ્નિની જ્વાળાઓ તે તો અતિ મોટી છે; તથા જેમ વરુણની મૂર્તિ તે તો મનુષ્ય જેવડી છે અને તેનું કાર્યરૂપ જે જળ તે તો અતિ ઝાઝું છે; અને જેમ સૂર્યની મૂર્તિ તો મનુષ્ય જેવી રથમાં બેઠી છે અને તેનું કાર્ય જે પ્રકાશ તે તો આખા બ્રહ્માંડમાં વ્યાપી રહ્યો છે; તેમ સર્વના કારણ એવા જે શ્રી પુરુષોત્તમ નારાયણ શ્રીકૃષ્ણ તે તો મનુષ્ય જેવડા છે તો પણ અનંત કોટિ બ્રહ્માંડના કારણ છે. અને જે મૂર્ખ હોય તે તો એમ સમજે ",
        user_id: 4
    }
]

const seedPosts = () => Post.bulkCreate(postData);

module.exports = seedPosts;
